Revit 2026 API

# CableTrayTypeBendMultiplier Property

---

Bend multiplier.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double BendMultiplier { get; set; }
```
```vb
Public Property BendMultiplier As Double
	Get
	Set
```
```cpp
public:
property double BendMultiplier {
	double get ();
	void set (double value);
}
```
```fsharp
member BendMultiplier : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The bend multiplier value should be positive and less than 3000. |

This should be positive and less than 3000.

#### Reference

CableTrayType Class

Autodesk.Revit.DB.Electrical Namespace